# GlazingTransmittanceColor Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Glazing..::..GlazingTransmittanceColor Property
Glazing Class See Also
---
The property labeled "Color" from the "Glazing" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string GlazingTransmittanceColor { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GlazingTransmittanceColor As String
	Get
```

Visual C++
---
```text
public:
static property String^ GlazingTransmittanceColor {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "GlazingTransmittanceColorType".
# See Also
Glazing Class
Autodesk.Revit.DB.Visual Namespace